app/controllers/food_controller.rb

SELECT "foods".* FROM "foods"
---
  def show
    p @foods = Food.all