app/controllers/food_controller.rb

  def vegan
    @vegan = Food.where(dietary_pref: 'Vegan')
    @vegans = @vegan[rand(@vegan.length)]
---
SELECT "foods".* FROM "foods" WHERE "foods"."dietary_pref" = $1  [["dietary_pref", "Meat"]]
SELECT "foods".* FROM "foods" WHERE "foods"."dietary_pref" = $1  [["dietary_pref", "Vegan"]]

  def vegan_dishes
    @vegan_list = Food.where(dietary_pref: 'Vegan')
---
SELECT "foods".* FROM "foods" WHERE "foods"."dietary_pref" = $1  [["dietary_pref", "Vegetarian"]]

  def vegan_recipes
    @vegan_list = Food.where(dietary_pref: 'Vegan')
---
SELECT "foods".* FROM "foods" WHERE "foods"."dietary_pref" = $1  [["dietary_pref", "Vegan"]]

  def vegetarian
    @vegetarian = Food.where(dietary_pref: 'Vegetarian')
    @vegetarians = @vegetarian[rand(@vegetarian.length)]
---
SELECT "foods".* FROM "foods" WHERE "foods"."dietary_pref" = $1  [["dietary_pref", "Meat"]]
SELECT "foods".* FROM "foods" WHERE "foods"."dietary_pref" = $1  [["dietary_pref", "Vegetarian"]]

  def vegetarian_dishes
    @vegetarian_list = Food.where(dietary_pref: 'Vegetarian')
---
SELECT "foods".* FROM "foods" WHERE "foods"."dietary_pref" = $1  [["dietary_pref", "Meat"]]

  def vegetarian_recipes
    @vegetarian_list = Food.where(dietary_pref: 'Vegetarian')
---
SELECT "foods".* FROM "foods" WHERE "foods"."dietary_pref" = $1  [["dietary_pref", "Meat"]]

  def meat
    @foods = Food.all
    @meat = Food.where(dietary_pref: 'Meat')
    @meats = @meat[rand(@meat.length)]
---
SELECT "foods".* FROM "foods" WHERE "foods"."dietary_pref" = $1  [["dietary_pref", "Meat"]]

  def meat_dishes
    @meat_list = Food.where(dietary_pref: 'Meat')
---
SELECT "foods".* FROM "foods" WHERE "foods"."dietary_pref" = $1  [["dietary_pref", "Meat"]]

  def meat_recipes
    @meat_list = Food.where(dietary_pref: 'Meat')
---
SELECT "foods".* FROM "foods" WHERE "foods"."dietary_pref" = $1  [["dietary_pref", "Meat"]]