app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "surname", "email", "password_digest", "gender", "dob", "created_at", "updated_at", "diet_pref") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"